app/Controllers/PedidosController.php

    public function crear(){
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Debes iniciar sesión para realizr un pedido.');
        }
        if ($this->request->getMethod() === 'POST') {
            $data = [
                'id_usuario'       => $session->get('id_usuario'),
                'nombre_cliente'   => $session->get('nombre'),
                'email_cliente'    => $session->get('email'),
                'telefono_cliente' => $session->get('telefono') ?? null,
                'total'            => $this->request->getPost('total') ?? 0,
            ];

            $pedidoId = $this->pedidoModel->insert($data);
---
INSERT INTO `pedidos` (`id_usuario`, `nombre_cliente`, `email_cliente`, `telefono_cliente`, `total`) VALUES ('2', NULL, 'panchito777@gmail.com', NULL, 0)

    protected function enviarEmailConfirmacion($pedidoId)
    {
        $pedido   = $this->pedidoModel->find($pedidoId);
        $detalles = $this->detalleModel->where('id_pedido', $pedidoId)->findAll();
---
SELECT *
FROM `pedidos`
WHERE `pedidos`.`id_pedido` = 4