app/Models/usuarioModel.php

    public function obtenerUsuarioPorId($id){

        return $this->where('id_usuario', $id)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '2'
 LIMIT 1